/** @file

Copyright (c) 2006 - 2014, Byosoft Corporation.<BR>
All rights reserved.This software and associated documentation (if any)
is furnished under a license and may only be used or copied in
accordance with the terms of the license. Except as permitted by such
license, no part of this software or documentation may be reproduced,
stored in a retrieval system, or transmitted in any form or by any
means without the express written consent of Byosoft Corporation.

File Name:
  UsbSetup.uni

Abstract:
  The definition of string used in  USB Setup setting.

Revision History:

$END--------------------------------------------------------------------

**/

/=#
#langdef   en-US "English"
#langdef   zh-Hans "\wide中文\narrow"

#string STR_COM_EMPTY                      #language en-US ""
                                           #language zh-Hans ""

                                           
#string STR_USB_FORM                       #language en-US "Usb Configuration"
                                           #language zh-Hans ""
#string STR_USB_FORM_HELP                  #language en-US "Usb Configuration"
                                           #language zh-Hans ""
                                           
#string STR_USB_MODE                       #language en-US "Usb Mode"
                                           #language zh-Hans ""
#string STR_USB_MODE_HELP                  #language en-US "Mode 1:EHCI only mode\nMode 2:EHCI and SSBI  mode\nMode 3:xHCI only mode\nMode 4:EHCI and xHCI Separate mode "
                                           #language zh-Hans ""
#string STR_DISABLED                       #language en-US "Disabled"
                                           #language zh-Hans ""
#string STR_MODE1                          #language en-US "Mode 1"
                                           #language zh-Hans ""
#string STR_MODE2                          #language en-US "Mode 2"
                                           #language zh-Hans ""                                           
#string STR_MODE3                          #language en-US "Mode 3"
                                           #language zh-Hans "" 
#string STR_MODE4                          #language en-US "Mode 4"
                                           #language zh-Hans "" 

#string STR_XHCI_MCU_DMA_PATH              #language en-US "XhciMcuDmaPath"
                                           #language zh-Hans ""
#string STR_XHCI_MCU_DMA_PATH_HELP         #language en-US "Xhci mcu dma path selection"
                                           #language zh-Hans ""
#string STR_STR_XHCI_MCU_DMA_PATH_NONSNOOP #language en-US "NonSnoop"
                                           #language zh-Hans ""
#string STR_STR_XHCI_MCU_DMA_PATH_SNOOP    #language en-US "Snoop"
                                           #language zh-Hans ""

#string STR_EMPTY                          #language en-US " "
#string STR_USB_MODE                       #language en-US "USB Mode Select"
#string STR_IOE_USB_MODE_HELP              #language en-US "Mode1:EHCI only mode       Mode2:EHCI and SSBI mode     Mode4:EHCI and xHCI Separate mode"
#string STR_DISABLED                       #language en-US "Disabled"
#string STR_MODE1                          #language en-US " Mode 1"
#string STR_MODE2                          #language en-US " Mode 2"                     
#string STR_MODE3                          #language en-US " Mode 3"
#string STR_MODE4                          #language en-US " Mode 4"
#string STR_DISABLE                        #language en-US "Disable"
#string STR_TRB_CACHE                      #language en-US "TRB Cache Bypass Mode"
#string STR_TRB_CACHE_HELP                 #language en-US "TRB Cache/Stream Context Cache Bypass Mode select"
#string STR_XHCI_OUTBURST_EN               #language en-US "Enable/Disable IN/OUT Bursting"
#string STR_XHCI_OUTBURST_EN_HELP          #language en-US "Enable/Disable IN/OUT Bursting"
#string STR_XHCI_U1U2_EN                   #language en-US "SS Port U1U2 Enable/Disable"
#string STR_XHCI_U1U2_EN_HELP              #language en-US "SS Port U1U2 Enable/Disable"
#string STR_XHCI_MSIFLUSH_EN               #language en-US "MSI Flush Enable/Disable"
#string STR_XHCI_MSIFLUSH_EN_HELP          #language en-US "MSI Flush Enable/Disable"
#string STR_XHCI_UART_EN                   #language en-US "Xhci Uart Enable/Disable"
#string STR_XHCI_UART_EN_HELP              #language en-US "Xhci Uart Enable/Disable"
#string STR_NOT_BYPASS                     #language en-US "Not Bypass"
#string STR_BYPASS                         #language en-US "Bypass"
#string STR_USBC_FLRSUP                    #language en-US "USBC FLR Support"
#string STR_USBC_FLRSUP_HELP               #language en-US "USBC FLR Enable/Disable select"
#string STR_DISABLED                       #language en-US "Disabled"
#string STR_ENABLED                        #language en-US "Enabled"
#string STR_XHCI_FLRSUP                    #language en-US "XHCI FLR Support"
#string STR_XHCI_FLRSUP_HELP               #language en-US "XHCI FLR Enable/Disable select"
#string STR_RTD3_CONTROL                   #language en-US "RTD3 Support"
#string STR_RTD3_CONTROL_HELP              #language en-US "RTD3 Enable/Disable select"
#string STR_USB_S4WAKEUP                   #language en-US "USB S4 WakeUp"
#string STR_USB_S4WAKEUP_HELP              #language en-US "USB S4 Wake Up"   
#string STR_USB_C4BLOCK                    #language en-US "USB Block C4"
#string STR_USB_C4BLOCK_HELP               #language en-US "USB Block C4 when iso transfer"      
#string STR_USB_OCEN                       #language en-US "Usb OC Enable"
#string STR_USB_OCEN_HELP                  #language en-US "Usb OC Enable" 
#string STR_USB_EITRN                      #language en-US "Usb Electrical Idle Triggered Retrain Enable/Disable"
#string STR_USB_EITRN_HELP                 #language en-US "Usb Electrical Idle Triggered Retrain Enable/Disable" 
#string STR_LEGACY_USB_EN                  #language en-US "Legacy Usb Support"
#string STR_LEGACY_USB_EN_HELP             #language en-US "Legacy Usb Support"
#string STR_XHC_SUPPORT                    #language en-US "Xhc Support"
#string STR_XHC_SUPPORT_HELP               #language en-US "Xhc Support"


                                         